OdRxLocalizedNameAttribute.sourceHint
\details
Retrieves a name string resource identifier hint.
\returns
Name string resource identifier hint. Zero if not set.

OdRxLocalizedNameAttribute.getLocalizedName(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Looks up OdRxLocalizedNameAttribute on the object if it is a member, (and in
the object class attribute list if it is not), and uses OdRxResourceLoader
to get the string from resources identified by ID and hint.
\param pO [in]  Object to get localized name of.
\returns
Localized name of the object if operation was successful; empty string
otherwise.

OdRxLocalizedNameAttribute.createObject(System.UInt32,System.UInt32)
\details
Construct an instance of the attribute to store a string identifier.
\param id         [in]  ID of the string.
\param sourceHint [in]  Resource ID hint.
\returns
Smart pointer to a constructed attribute object.